# s = "hello lin"

# 索引的语法 字符串对象
# print(s[6], type(s[6]))  # "y"
# print(s[0])
# print(s[-1])
#
# # (2)切片的语法：字符串对象[开始索引:结束索引]
# print(s[0:4])  # 左闭右开，顾头不顾腚
# print(s[6:8])
# # print(s[6:9])  # 取到最后一个，但不建议
# # print(s[6:10])  # 取到最后一个，但不建议
# print(s[6:])  # 冒号右边缺省，取到尾部
# print(s[:5])  # 冒号左边缺省，取到尾部
# print(s[:])  # 从头取到尾
# print(s[6:8])
# print(s[-3:-1])
# print(s[6:-1])

# 切片的语法扩展：字符串对象[开始索引:结束索引:步长]
# 步长默认长度为1
s = "hello yuan"
# print(s[::1])  # step=1:从左向右一个个取
# print(s[::2])
# print(s[::3])
# print(s[::-1])  # step=-1:从右向左一个个取
print(s[0:3])
print(s[3:0])  # 不可以这样用，只会拿到空值
print(s[3:0:-1])  # 从高到低步长得是负数
print(s[-2:-4:-1])
