s1 = "lin is very 帅！"
s2 = 'rain'
print(s1)
s3 = "10"
print(type(s1))
print(type(s3))
# print(S3 + 2)
news01 = '习主席再提"中欧之桥"'
print(news01)

poem = """
大江东去，浪淘尽，千古风流人物。
    故垒西边，人道是，三国周郎赤壁。
乱石穿空，惊涛拍岸，卷起千堆雪。(穿空 一作：崩云)
江山如画，一时多少豪杰。

遥想公瑾当年，小乔初嫁了，雄姿英发。
羽扇纶巾，谈笑间，樯橹灰飞烟灭。(樯橹 一作：强虏)
故国神游，多情应笑我，早生华发。
人生如梦，一尊还酹江月。(人生 一作：人间；尊 同：樽)
"""
print(poem)

trans = ("大江之水滚滚不断向东流去，淘尽了那些千古风流的人物。"
         "在那久远古战场的西边地方，说是三国周瑜破曹军的赤壁。"
         "四面石乱山高两岸悬崖如云，惊涛骇浪猛烈地拍打着对岸，卷起浪花仿佛冬日的千堆雪。"
         "江山如此的美丽如图又如画，一时间涌出了多少英雄豪杰。"
         "遥想当年的周郎名瑜字公瑾，小乔刚刚嫁给了他作为妻子，英姿雄健风度翩翩神采照人。"
         "手中执着羽扇头上著着纶巾，从容潇洒地在说笑闲谈之间，八十万曹军如灰飞烟灭一样。"
         "如今我身临古战场神游往昔，可笑我有如此多的怀古柔情，竟如同未老先衰般鬓发斑白。"
         "人生如同一场朦胧的梦似的，举起酒杯奠祭这万古的明月。")
print(trans)
